{
    "flags" : [
        {
            "x" : "1890",
            "y" : "1950",
            "note" : "In a boat at the end of the canal."
        },
        {
            "x" : "2160",
            "y" : "2018",
            "note" : "On a high, small wooden plank."
        },
        {
            "x" : "2380",
            "y" : "1882",
            "note" : "On a high wooden bridge connecting two buildings, stretching over the canal."
        },
        {
            "x" : "2615",
            "y" : "2055",
            "note" : "In the boat at the very end of the canal."
        },
        {
            "x" : "2860",
            "y" : "1990",
            "note" : "On top of a small cage/spire, next to a rooftop garden."
        },
        {
            "x" : "2910",
            "y" : "1890",
            "note" : "On a small, one-story structure with a wooden roof in a small courtyard."
        },
        {
            "x" : "3080",
            "y" : "1850",
            "note" : "On a wooden balcony up one story, on a building right on the city border wall."
        },
        {
            "x" : "3247",
            "y" : "1762",
            "note" : "On a tall upright pole, which sits on a 1-story wood deck in between two 2-story buildings."
        },
        {
            "x" : "2885",
            "y" : "1681",
            "note" : "On one of the several skinny wooden planks over the indoor street (this is inside the long building!)."
        },
        {
            "x" : "2821",
            "y" : "1634",
            "note" : "Ground, in small alley between building and fenced garden."
        },
        {
            "x" : "2845",
            "y" : "1758",
            "note" : "On the roof of the long building, near the edge, where the long, dome-shaped divider meets the edge."
        },
        {
            "x" : "2623",
            "y" : "1805",
            "note" : "On a wooden roof connecting the roofs of two buildings."
        },
        {
            "x" : "2308",
            "y" : "1768",
            "note" : "On a short porch on the side of a building, near ground level."
        },
        {
            "x" : "2129",
            "y" : "1643",
            "note" : "On the ground, in a small alley."
        },
        {
            "x" : "1961",
            "y" : "1661",
            "note" : "On the corner of the roof of the building with a large dome, in plain view."
        },
        {
            "x" : "2014",
            "y" : "1526",
            "note" : "On the roof of the small, triangular building, in plain view."
        },
        {
            "x" : "1980",
            "y" : "1344",
            "note" : "Down a tiny alley with a bench that is easy to miss, under a wooden roof."
        },
        {
            "x" : "2117",
            "y" : "1131",
            "note" : "At ground level, right next to a building, to the left of the haystack."
        },
        {
            "x" : "2222",
            "y" : "1176",
            "note" : "Down a small alley."
        },
        {
            "x" : "2361",
            "y" : "1184",
            "note" : "On a small wooden overhang on the side of a building, near ground level."
        },
        {
            "x" : "2444",
            "y" : "1352",
            "note" : "At ground level, near the wall of a building."
        },
        {
            "x" : "2268",
            "y" : "1467",
            "note" : "On a wooden roof one story up, under a wooden overhang."
        },
        {
            "x" : "2352",
            "y" : "1500",
            "note" : "At ground level, in a small alley."
        },
        {
            "x" : "2452",
            "y" : "1487",
            "note" : "At ground level, in a small garden with no entrances; you must jump over a short wall to get into it."
        },
        {
            "x" : "2626",
            "y" : "1306",
            "note" : "At ground level, in a small alley."
        },
        {
            "x" : "2835",
            "y" : "1094",
            "note" : "On a wooden overhang on the wall of a building."
        },
        {
            "x" : "2993",
            "y" : "1234",
            "note" : "In plain view, on a short wall in the middle of a short set of stairs."
        },
        {
            "x" : "3071",
            "y" : "1494",
            "note" : "In a section of the roof closed off by the long, dome-shaped divider."
        },
        {
            "x" : "3179",
            "y" : "1400",
            "note" : "At the end of a small alley, at the bottom of a ladder."
        },
        {
            "x" : "3456",
            "y" : "1373",
            "note" : "On the roof of a building, next to the large dome, in plain view."
        },
        {
            "x" : "3500",
            "y" : "1238",
            "note" : "On a small, ground level porch."
        },
        {
            "x" : "3370",
            "y" : "1196",
            "note" : "Ground level, down a small, twisting alley between two buildings."
        },
        {
            "x" : "3160",
            "y" : "1080",
            "note" : "On a wooden roof one story up, surrounded by 3 two-story buildings."
        },
        {
            "x" : "1883",
            "y" : "776",
            "note" : "Ground level, in a small courtyard, under a curved stone roof."
        },
        {
            "x" : "1954",
            "y" : "534",
            "note" : "On a wooden overhang."
        },
        {
            "x" : "2071",
            "y" : "555",
            "note" : "On the roof, in plain sight, next to one orange safe place."
        },
        {
            "x" : "2029",
            "y" : "649",
            "note" : "Ground level, in a small courtyard."
        },
        {
            "x" : "2070",
            "y" : "840",
            "note" : "In between a one and two story buildings, in bottom of a ladder."
        },
        {
            "x" : "2174",
            "y" : "831",
            "note" : "On the roof, next to some crates, in plain sight."
        },
        {
            "x" : "2326",
            "y" : "750",
            "note" : "Ground level, in a small courtyard."
        },
        {
            "x" : "2266",
            "y" : "949",
            "note" : "Above the plaza, on a hanging wooden platform."
        },
        {
            "x" : "2382",
            "y" : "897",
            "note" : "Ground level, in a short alley, next to a tree."
        },
        {
            "x" : "2455",
            "y" : "844",
            "note" : "In a narrow alley, next to/behind a stone wall, depends on which side you approach it."
        },
        {
            "x" : "2471",
            "y" : "928",
            "note" : "On a small one story roof, next to a ladder."
        },
        {
            "x" : "2600",
            "y" : "890",
            "note" : "On a wooden balcony resembling structure in the side of the large building."
        },
        {
            "x" : "2550",
            "y" : "780",
            "note" : "This is inside the large building that has a courtyard inside, in one of the corners of the walkway on ground level."
        },
        {
            "x" : "2691",
            "y" : "935",
            "note" : "In between a one and a two story building, at the bottom of a ladder. There is a wooden overhang above it."
        },
        {
            "x" : "2818",
            "y" : "911",
            "note" : "In a short alley, next to a tree, a door and a ladder."
        },
        {
            "x" : "2921",
            "y" : "776",
            "note" : "On the rooftop, in middle of three domes."
        },
        {
            "x" : "3082",
            "y" : "749",
            "note" : "In a closed off area by the large temple at ground level."
        },
        {
            "x" : "3111",
            "y" : "857",
            "note" : "On a stone overpass, next to a cage-resembling structure, with ladders on both sides."
        },
        {
            "x" : "3333",
            "y" : "958",
            "note" : "Up high on the roof, on a wooden beam."
        },
        {
            "x" : "3518",
            "y" : "903",
            "note" : "On a wooden overhang, behind one of the domes of the large building."
        },
        {
            "x" : "3356",
            "y" : "805",
            "note" : "On the roof, between a small building and the city wall."
        },
        {
            "x" : "3133",
            "y" : "564",
            "note" : "On a rooftop, in plain sight, next to the city wall."
        },
        {
            "x" : "2974",
            "y" : "644",
            "note" : "In a narrow alley, next to/behind a stone wall, depends on which side you approach it."
        },
        {
            "x" : "2815",
            "y" : "576",
            "note" : "On the roof, in plain sight, next to some crates."
        },
        {
            "x" : "2817",
            "y" : "761",
            "note" : "Up high on the roof, on a wooden overhang."
        },
        {
            "x" : "2736",
            "y" : "675",
            "note" : "In a small courtyard, behind a ladder, under a wooden overhang. The courtyard also has double wooden doors guarded by two guards."
        },
        {
            "x" : "2592",
            "y" : "558",
            "note" : "On the roof, on top of one of those cage-looking structures."
        },
        {
            "x" : "2563",
            "y" : "434",
            "note" : "Ground level, on top of some small stairs, in front of a door, next to a fence."
        },
        {
            "x" : "2553",
            "y" : "711",
            "note" : "On a rooftop, between some crates and baskets."
        },
        {
            "x" : "2477",
            "y" : "606",
            "note" : "On a small rooftop one story high, there is a wooden beam above it."
        },
        {
            "x" : "2342",
            "y" : "587",
            "note" : "On the roof, next to some crates."
        },
        {
            "x" : "2279",
            "y" : "515",
            "note" : "On a small roof, one story high, next to some barrels and a door."
        },
        {
            "x" : "2280",
            "y" : "431",
            "note" : "Ground level, in front of a door, surrounded by fence."
        },
        {
            "x" : "2368",
            "y" : "490",
            "note" : "In a small courtyard, behind a ladder, under a wooden overhang."
        },
        {
            "x" : "1662",
            "y" : "1946",
            "note" : "In the middle of a room one story up without a roof."
        },
        {
            "x" : "1482",
            "y" : "1894",
            "note" : "In plain view, on a roof 2 stories up."
        },
        {
            "x" : "1224",
            "y" : "1731",
            "note" : "On a wooden platform hanging over the street."
        },
        {
            "x" : "1156",
            "y" : "1462",
            "note" : "On a wood awning overlooking the canal. You need to climb the building then drop down to the awning and you should land right on top of it."
        },
        {
            "x" : "1000",
            "y" : "1444",
            "note" : "On a roof 2 stories up."
        },
        {
            "x" : "835",
            "y" : "1468",
            "note" : "At the end of a small alley with two sets of stairs, right in front of a large wall."
        },
        {
            "x" : "835",
            "y" : "1663",
            "note" : "Inside one of the hallways surrounding the large courtyard, at ground level."
        },
        {
            "x" : "600",
            "y" : "1503",
            "note" : "High up on a wooden plank in the opening in the wall (guarded by 4 guards on the ground)."
        },
        {
            "x" : "443",
            "y" : "1544",
            "note" : "On a low wooden overhang at the end of a small alley."
        },
        {
            "x" : "500",
            "y" : "1368",
            "note" : "In the middle of a small, half-destroyed room a couple stories up."
        },
        {
            "x" : "641",
            "y" : "1303",
            "note" : "In a tiny room on the side of the small room with a bench."
        },
        {
            "x" : "593",
            "y" : "1121",
            "note" : "Ground level, near a well and a tree, next to the canal."
        },
        {
            "x" : "988",
            "y" : "1197",
            "note" : "On a small, ground level bridge extending over the canal."
        },
        {
            "x" : "1247",
            "y" : "1247",
            "note" : "Ground level, in a small room on the side of the street."
        },
        {
            "x" : "1542",
            "y" : "1407",
            "note" : "Get to ground level inside the courtyard and look up to its location on the map. You should see it a couple stories up on a balcony. Climb up to its level and shimmy over to it."
        },
        {
            "x" : "1561",
            "y" : "1561",
            "note" : "Climb up to the roof and look down into the courtyard. It’s on a pillar in the courtyard."
        },
        {
            "x" : "1432",
            "y" : "1590",
            "note" : "On the roof, right next to the huge dome."
        },
        {
            "x" : "1725",
            "y" : "1700",
            "note" : "Ground level, in a small alley."
        },
        {
            "x" : "1763",
            "y" : "1543",
            "note" : "Ground level, in a small courtyard enclosed by some buildings."
        },
        {
            "x" : "1610",
            "y" : "1211",
            "note" : "Way up on the highest tiled roof."
        },
        {
            "x" : "1800",
            "y" : "1140",
            "note" : "In an open room one story up."
        },
        {
            "x" : "1737",
            "y" : "975",
            "note" : "In a corner down an alley, at ground level."
        },
        {
            "x" : "1497",
            "y" : "1070",
            "note" : "On top of the long dome-shaped divider on the roof."
        },
        {
            "x" : "1124",
            "y" : "990",
            "note" : "Ground level, in a corner, outside the covered market."
        },
        {
            "x" : "703",
            "y" : "918",
            "note" : "On a horizontal wooden plank above a door on the street."
        },
        {
            "x" : "908",
            "y" : "744",
            "note" : "In an open room one story up."
        },
        {
            "x" : "990",
            "y" : "860",
            "note" : "On one of the wooden planks above the market, inside the building."
        },
        {
            "x" : "1129",
            "y" : "879",
            "note" : "At ground level in the covered market, in a side room."
        },
        {
            "x" : "1590",
            "y" : "808",
            "note" : "On a roof 2 stories up."
        },
        {
            "x" : "1728",
            "y" : "808",
            "note" : "In an open room one story up."
        },
        {
            "x" : "1728",
            "y" : "539",
            "note" : "In a balcony in a courtyard enclosed by some buildings."
        },
        {
            "x" : "1375",
            "y" : "622",
            "note" : "At the top of the highest roof. Inside the compound there is a wooden mesh on the east side of the building that you can use to climb up."
        },
        {
            "x" : "1094",
            "y" : "475",
            "note" : "Ground level, on a platform in the water."
        }
    ]
}